#+BEGIN_SRC emacs-lisp :exports both
  (emacs-version)
#+END_SRC

  Before everything loading my custom setting file
#+BEGIN_SRC emacs-lisp
  (setq custom-file (concat user-emacs-directory "custom.el"))
  (load custom-file)
#+END_SRC

* About

  *Feel free to copy anything you want.*

  Some settings are present in my ~custom.el~. I try to merge them
  into my org-babel file from time to time.

#+BEGIN_SRC emacs-lisp :exports both
  (emacs-version)
#+END_SRC

#+RESULTS:
: GNU Emacs 24.5.1 (x86_64-apple-darwin13.4.0, NS apple-appkit-1265.21)
:  of 2015-04-10 on builder10-9.porkrind.org

* Exec path
   Picking ~PATH~ from shell
#+BEGIN_SRC emacs-lisp
  (require-package 'exec-path-from-shell)
  (exec-path-from-shell-initialize)
  (exec-path-from-shell-copy-env "DOCKER_HOST")
  (exec-path-from-shell-copy-env "DOCKER_TLS_VERIFY")
#+END_SRC

#+RESULTS:
: 1

   Furthermore, on mac, /path_helper/ is messing with the path. I commented the
   calls to path helper in /etc/profile/ and /etc/zshenv/

* Fonts
  #+BEGIN_SRC emacs-lisp
    (set-frame-font "PragmataPro-14")
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                (progn
                  (set-frame-font "PragmataPro-14"))))
  #+END_SRC

  #+RESULTS:
  | evil-init-esc | (lambda (frame) (progn (set-frame-font PragmataPro-14))) | select-frame |

* Encoding

   I want UTF-8 everywhere.
#+BEGIN_SRC emacs-lisp
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (setq buffer-file-coding-system 'utf-8)
  (setq erc-server-coding-system '(utf-8 . utf-8))
  (setq locale-coding-system 'utf-8)
  (setq org-export-coding-system (quote utf-8))
  (setq org-export-html-coding-system (quote utf-8))
  ;; Treat clipboard input as UTF-8 string first; compound text next, etc.
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))
#+End_SRC

#+RESULTS:
| UTF8_STRING | COMPOUND_TEXT | TEXT | STRING |

   Making sure emacs language environment variables are also
   specifying UTF-8. When starting Emacs with a GUI, it is not
   always the case.
   Great explanation of emacs environment variables [[http://ergoemacs.org/emacs/emacs_env_var_paths.html][here]].
#+BEGIN_SRC emacs-lisp
    (setenv "LANG" "fr_FR.UTF-8")
    (setenv "LC_ALL" "fr_FR.UTF-8")
#+END_SRC

#+RESULTS:
: fr_FR.UTF-8

* org-mode

Making sure I have the latest /Emacs/.
#+BEGIN_SRC emacs-lisp
  (require-package 'org)
  (require-package 'org-bullets)
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
  (set-display-table-slot standard-display-table
                          'selective-display (string-to-vector " ･･･ "))
#+END_SRC

#+RESULTS:
:  ･･･

** Settings
   Auto-correction, automatic paragraph.
#+BEGIN_SRC emacs-lisp
  ;;(add-hook 'org-mode-hook '(lambda ()
                              ;;(turn-on-flyspell)
    ;;                          (writegood-mode t)))
  (setq org-indent-mode t)
  (setq org-indent-indentation-per-level 2)
#+END_SRC

#+RESULTS:
: 2

   Automatically break line at a previous space, in insertion of text
#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook 'turn-on-auto-fill)
#+END_SRC

   Customizing keywords and tags to reflect “Getting Things Done”
   methodology.
#+BEGIN_SRC emacs-lisp
  (setq org-todo-keywords
        '((sequence "TODO(t)" "WAITING(w!)" "|" "DONE(d!)" "CANCELED(c!)")))
  (setq org-tag-alist '(("next" . ?n)
                        ("maybe" . ?m)
                        ("waiting" . ?w)
                        ("read" . ?r)))

#+END_SRC

   Colored code block
#+BEGIN_SRC emacs-lisp
  (setq org-src-fontify-natively t)
#+END_SRC

   I take notes with a custom [[http://www.alfredapp.com/][Alfred]] action that writes to an org
   files named /inbox.org/. Occasionally I refile those notes into
   other org-files using ~C-c C-w~ on headlines.
#+BEGIN_SRC emacs-lisp
  (setq org-refile-use-outline-path t)
  ;; Targets include this file and any file contributing to the agenda - up to 9 levels deep
  (setq org-refile-targets (quote ((nil :maxlevel . 9)
                                   (org-agenda-files :maxlevel . 9))))
#+END_SRC

   Setting up the clock for time tracking
#+BEGIN_SRC emacs-lisp
  (setq org-clock-persist 'history)
  (org-clock-persistence-insinuate)
#+END_SRC

  Multiline emphasis
#+begin_src emacs-lisp
  (setcar (nthcdr 4 org-emphasis-regexp-components) 2)
#+end_src

#+RESULTS:
: 2

*** Publishing
  C-c C-e for publishing options or run ~org-publish-project~
#+BEGIN_SRC emacs-lisp
  (require 'ox-publish)
  (setq org-publish-project-alist
        '(("org-notes"
           :base-directory "~/projects/aurelienbottazini.com/_org/"
           :base-extension "org"
           :publishing-directory "~/projects/aurelienbottazini.com/"
           :recursive t
           :publishing-function org-html-publish-to-html
           :headline-levels 4
           :auto-preamble t
           :html-extension "html"
           :with-toc nil
           :body-only t
           )))
#+END_SRC

#+RESULTS:
| org-notes | :base-directory | ~/projects/aurelienbottazini.com/_org/ | :base-extension | org | :publishing-directory | ~/projects/aurelienbottazini.com/ | :recursive | t | :publishing-function | org-html-publish-to-html | :headline-levels | 4 | :auto-preamble | t | :html-extension | html | :with-toc | nil | :body-only | t |

* Visual interface
   No bell
   #+BEGIN_SRC emacs-lisp
       (setq ring-bell-function 'ignore)
   #+END_SRC

   #+RESULTS:
   : ignore

   I want to hide extra bars. I like my Emacs clean. I don't use the
   mouse and I want to do everything through the keyboard
   #+BEGIN_SRC emacs-lisp
     (if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
     (if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
     (if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
   #+END_SRC

   #+RESULTS:

   #+BEGIN_SRC emacs-lisp
     (when (string-match "apple-darwin" system-configuration)
       ;; on mac, there's always a menu bar drown, don't have it empty
       (when window-system
         (menu-bar-mode 1)))
   #+END_SRC

   #+RESULTS:

   Show end of buffer with /q/ left fringe.
   #+BEGIN_SRC emacs-lisp
     (setq default-indicate-empty-lines t)
   #+END_SRC

   Delete selected text when typing
   #+BEGIN_SRC emacs-lisp
     (delete-selection-mode 1)
   #+END_SRC

   Different buffer names when a new buffer has the same name as
   an existing one.
   #+BEGIN_SRC emacs-lisp
     (require 'uniquify "uniquify")
     (setq uniquify-buffer-name-style 'forward)
   #+END_SRC

   #+RESULTS:
   : forward

    File path in frame title.
   #+BEGIN_SRC emacs-lisp
     (setq frame-title-format
           '((:eval (if (buffer-file-name)
                        (abbreviate-file-name (buffer-file-name))
                      "%b"))))
   #+END_SRC

   #+RESULTS:
   | :eval | (if (buffer-file-name) (abbreviate-file-name (buffer-file-name)) %b) |

* prog-mode(s)

  Hexadecimal strings colored with corresponding colors in certain
  modes
#+BEGIN_SRC emacs-lisp
  (require-package 'rainbow-mode)
  (add-hook 'prog-mode-hook 'rainbow-mode)
  (setq rainbow-html-colors-major-mode-list
   (quote
    (html-mode css-mode php-mode nxml-mode xml-mode less-css-mode scss-mode)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ;; (setq comment-auto-fill-only-comments t)
  ;; (add-hook 'prog-mode-hook
  ;;         (lambda ()
  ;;           (turn-on-auto-fill)
  ;;           ))
  ;;(add-hook 'prog-mode-hook 'flyspell-prog-mode)

  ;; I want to only check spelling inside comments and doc. Not in strings
  (setq flyspell-prog-text-faces '(font-lock-comment-face font-lock-doc-face))

#+END_SRC

#+RESULTS:
| font-lock-comment-face | font-lock-doc-face |

** Haml
#+BEGIN_SRC emacs-lisp
 (require-package 'haml-mode)
 (add-hook 'haml-mode-hook '(lambda () (highlight-indentation-mode)))
#+END_SRC

#+RESULTS:
| lambda | nil | (highlight-indentation-mode) |

*** Palimpset mode
   C-c C-r send selected text to the bottom
   C-c C-q send selected text to trash file
#+begin_src emacs-lisp
  (require-package 'palimpsest)
#+end_src

#+RESULTS:
| [cl-struct-package-desc palimpsest (20130731 821) Various deletion strategies when editing nil single melpa nil nil nil] |

* Emoji
#+begin_src emacs-lisp
  (defun --set-emoji-font (frame)
    "Adjust the font settings of FRAME so Emacs can display emoji properly."
    (if (eq system-type 'darwin)
        ;; For NS/Cocoa
        (set-fontset-font t 'symbol (font-spec :family "Apple Color Emoji") frame 'prepend)
      ;; For Linux
      (set-fontset-font t 'symbol (font-spec :family "Symbola") frame 'prepend)))

  ;; For when Emacs is started in GUI mode:
  (--set-emoji-font nil)
  ;; Hook for when a frame is created with emacsclient
  ;; see https://www.gnu.org/software/emacs/manual/html_node/elisp/Creating-Frames.html
  (add-hook 'after-make-frame-functions '--set-emoji-font)
  (require-package 'emojify)
  (add-hook 'after-init-hook #'global-emojify-mode)
  (require 'company-emoji)
  (add-to-list 'company-backends 'company-emoji)
#+end_src

#+RESULTS:
| company-emoji | (company-yasnippet company-keywords company-dabbrev-code company-dabbrev company-files) |

